# ResList_ImportItem

## Description
Import the currently selected item. This is the list that typically is created by call to BuildResourceList. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
FUNCTION ResList_ImportItem(uniqueID : STRING): HANDLE;
```

```python
def vs.ResList_ImportItem(uniqueID):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* Document List Handling